[
  {
    "name": "find",
    "description": "Find (try to locate) in the scene the specified object, getting its position",
    "parameters": {
      "object": "The object that we want the robot to find. For example, apple, fridge, TV, etc."
    }
  },
  {
    "name": "go_to",
    "description": "Move (navigate) to the specified object. To be able to execute this action, the robot must have previously found the specified object via the \"find\" action",
    "parameters": {
      "object": "The object that we want the robot to go to. For example, apple, fridge, TV, etc."
    }
  },
  {
    "name": "pick_up",
    "description": "Pick up (grab) the specified object. To be able to execute this action, the robot must have previously gone to the specified object via the \"go_to\" action. The robot can only hold one object at a time, so if it is already holding an object, it must put it down before it can pick up a new object",
    "parameters": {
      "object": "The object that we want the robot to pick up. For example, apple, mug, credit card, etc."
    }
  },
  {
    "name": "put_down_grasped_object_on",
    "description": "Put down the object that the robot is currently holding on the receptacle specified as argument. To be able to execute this action, the robot must be holding an object and have previously gone to the specified receptacle via the \"go_to\" action",
    "parameters": {
      "receptacle": "The receptacle that we want the robot to place the object on. For example, dining table, microwave, countertop, etc."
    }
  },
  {
    "name": "toggle",
    "description": "Toggle the specified object, switching it from its on/off states. To be able to execute this action, the robot must have previously either gone to the object (TV, light switch, etc.) or picked up the object (remote control, cell phone, etc.)",
    "parameters": {
      "object": "The object that we want the robot to toggle. For example, remote control, TV, coffee machine, desk lamp, light switch, etc."
    }
  },
  {
    "name": "slice",
    "description": "Slice the specified object, cutting it into portions. To be able to execute this action, the robot must have first picked up a knife and then gone to the object to slice. Immediately after executing this action, the robot must put the knife down",
    "parameters": {
      "object": "The object that we want the robot to slice. For example, bread, apple, tomato, etc."
    }
  },
  {
    "name": "open",
    "description": "Open the specified object. To be able to execute this action, the robot must have previously gone to the specified object via the \"go_to\" action. This action is needed to put items inside openable objects such as drawers, cabinets, fridges, microwaves, etc. Immediately after opening the specified object (and possibly picking up or putting something inside), the robot must close it",
    "parameters": {
      "object": "The object that we want the robot to open. For example, fridge, drawer, cabinet, microwave, etc."
    }
  },
  {
    "name": "close",
    "description": "Close the specified object. To be able to execute this action, the robot must have previously gone to the specified object via the \"go_to\" action. The robot must close every object that is opens",
    "parameters": {
      "object": "The object that we want the robot to close. For example, fridge, drawer, cabinet, microwave, etc."
    }
  },
  {
    "name": "wait",
    "description": "Wait the number of specified seconds. This action is necessary to perform tasks such as making a coffee, washing an object, or microwaving something, since some time is required to pass for the previous action to produce the desired effect",
    "parameters": {
      "seconds": "The number of seconds that we want the robot to wait. For example, 15, 30, 60, etc."
    }
  }
]